homework/app/controllers/theaters_controller.rb

SELECT "theaters".* FROM "theaters"
---
	def index
		@theaters = Theater.all

INSERT INTO "theaters" ("address", "name", "phoneNumber") VALUES (?, ?, ?)  [["address", "Taipei, Taiwan"], ["name", "Small Big Egg"], ["phoneNumber", "01011911235"]]
---
    def create
    	t = Theater.new
    	t.name = params[:name]
    	t.address = params[:address]
    	t.phoneNumber = params[:phoneNumber]
    	t.save

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
---
  	def show
    	@theater = Theater.find_by_id(params[:id])

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
---
  	def edit
    	@theater = Theater.find_by_id(params[:id])

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
UPDATE "theaters" SET "name" = 'Lincoln Center for Performing Arts', "address" = 'Columbus Avenue, W62 to W66', "phoneNumber" = '13127468754' WHERE "theaters"."id" = 3
---
  	def update
    	@theater = Theater.find_by_id(params[:id])
    	@theater.name = params[:name]
    	@theater.address = params[:address]
    	@theater.phoneNumber = params[:phoneNumber]
    	@theater.save

SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 1]]
---
  	def destroy
    	t = Theater.find_by_id(params[:id])
    	t.destroy